//
// Created by Sybatron on 6/23/2026.
//

#ifndef MARKDOWNPARSER_MARKDOWNCLI_H
#define MARKDOWNPARSER_MARKDOWNCLI_H
// Превод на файл
// > translate <input> <output>
// Превежда входния Markdown файл от <input> към HTML и записва резултата в <output>. Ако <output> вече съществува, потребителят трябва да бъде попитан за потвърждение преди презаписване.
// Output: Резултат от операцията. При грешки (несъществуващ входен файл, невалиден синтаксис, проблеми при запис) - подходящо съобщение.
// Извеждане на синтактичното дърво
// > print <input>
// Принтира синтактичното дърво на Markdown файла <input> в подходящ форматиран вид. Дървото трябва да включва всички редове и всички вложени форматиращи елементи. Ако дървото не се събира на един екран, да се поддържа странициране.
// Проверка на валидност
// > validate <input>
// Проверява дали входният файл съдържа валиден Markdown по описания синтаксис. При грешки - извежда списък с редовете и описание на грешката (например незатворен ** блок, неподходящо ниво на #, и т.н.).
// Информация за файл
// > info <input>
// Извежда статистика за входния файл - брой редове, разпределение по тип (брой h1, h2, …, p, hr), брой форматиращи елементи (брой \<i>, \<b>, \<code>, \<s>).
// Изход от програмата
// > exit
// Прекратява програмата.
// Където е необходимо, входните данни трябва да бъдат валидирани. Да се вземат предвид всякакви гранични случаи: незатворени форматиращи блокове (** без съответно затваряне), невалидни редове (повече от 6 нива на #), празни файлове, файлове само с празни редове, специални символи в съдържанието.
// Да се отчетат всички проблеми при работа с файловете - проблеми с достъпа до файла, проблеми при четене и запис, потенциално повредени файлове, опит за работа с файлове, които не са текстови.
// При обработване на командите да се вземат предвид потенциални грешки на потребителя (некоректно въведени команди или критерии) и да се извеждат подходящи помощни съобщения.


class MarkdownCli {
};


#endif //MARKDOWNPARSER_MARKDOWNCLI_H
